
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	 Если Объект.Товары.Итог("Сумма") < 1000 Тогда
        Отказ = Истина;
        Сообщить("Минимальная сумма заказа составляет 1000 рублей!");
     КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)  
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
    Если ТекущаяСтрока = Неопределено Тогда
        ПроцентСуммыДокумента = 0;
        Возврат;
    КонецЕсли;
    
    ОбщаяСумма = Объект.Товары.Итог("Сумма"); 
	
	Если Не ОбщаяСумма = 0 Тогда
		
    	ПроцентСуммыДокумента = Окр((ТекущаяСтрока.Сумма / ОбщаяСумма * 100), 2);  
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоТовараВЗаказе(Команда)
    
    ОбщееКоличество = Объект.Товары.Итог("Количество");
    Сообщить("Общее количество по документу: " + ОбщееКоличество);
    
КонецПроцедуры