
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РасходнаяНакладная)
	ТабДок = Новый ТабличныйДокумент;
	РасходнаяНакладная(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура РасходнаяНакладная(ТабДок, ПараметрКоманды)
	Документы.РеализацияТоваровУслуг.РасходнаяНакладная(ТабДок, ПараметрКоманды);
КонецПроцедуры
