
&НаКлиенте
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    ДиалогСохраненияФайла.ПолноеИмяФайла = "Прайс-лист " + ВидЦены + " от " + Формат(ТекущаяДата(), "ДЛФ=D");
    ДиалогСохраненияФайла.Фильтр = "Файлы Excel (*.xlsx)|*.xlsx";
    ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
    ДиалогСохраненияФайла.Заголовок = "Выберите путь сохранения Прайс-листа";

    МассивИменФайлов = Ждать ДиалогСохраненияФайла.ВыбратьАсинх();

    Если ЗначениеЗаполнено(МассивИменФайлов) Тогда
        ПутьКФайлу = МассивИменФайлов[0];
	КонецЕсли;     
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)       
	
    Если Не ПроверитьЗаполнение() Тогда
        Возврат;
    КонецЕсли;
    
    ВыгрузитьВФайлНаСервере();
    
КонецПроцедуры

&НаСервере
Функция ТаблицаТекущийПрайсЛист()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул КАК Артикул,
        |    ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование КАК Номенклатура,
        |    ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
        |ИЗ
        |    РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
        |ГДЕ
        |    ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
    
    Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
    
    РезультатЗапроса = Запрос.Выполнить();
    Возврат РезультатЗапроса.Выгрузить();
    
КонецФункции

&НаСервере
Процедура ВыгрузитьВФайлНаСервере()
    
    ТаблицаДанных = ТаблицаТекущийПрайсЛист();
    
    Если ТаблицаДанных.Количество() = 0 Тогда
        Сообщить("По выбранному виду цены не найдено установленных цен!");
        Возврат;
    КонецЕсли;
    
    ТабличныйДокумент = Новый ТабличныйДокумент;
    
    Построитель = Новый ПостроительОтчета;
    Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанных);
    Построитель.Вывести(ТабличныйДокумент);
    
    Попытка
        ТабличныйДокумент.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLSX);
        Сообщить("Выгрузка завершена! файл: " + ПутьКФайлу);
    Исключение
        Сообщить("Ошибка выгрузки: " + ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

&НаСервере
Функция ПоказатьПрайсЛистНаСервере()
    
    ТаблицаДанных = ТаблицаТекущийПрайсЛист();
    
    Если ТаблицаДанных.Количество() = 0 Тогда
        Сообщить("По выбранному виду цены не найдено установленных цен!");
        Возврат Неопределено;
    КонецЕсли;
    
    ТабличныйДокумент = Новый ТабличныйДокумент;
    
    Построитель = Новый ПостроительОтчета;
    Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанных);
    Построитель.Вывести(ТабличныйДокумент);
		
    Возврат ТабличныйДокумент;
    
КонецФункции

&НаКлиенте
Процедура ПоказатьПрайсЛист(Команда)
    
    Если Не ПроверитьЗаполнение() Тогда
        Возврат;
    КонецЕсли;
    
    ТабличныйДокумент = ПоказатьПрайсЛистНаСервере();
    
    Если ТабличныйДокумент <> Неопределено Тогда
        ТабличныйДокумент.Показать();
    КонецЕсли;
    
КонецПроцедуры